


# 1. იპოვეთ დუბლიკატები
def find_duplicates(dictionary):# იღებს ლექსიკონს შეყვანის სახით და აბრუნებს მისი გასაღებების დახარისხებულ სიას
    keys_list = list(dictionary.keys())#გარდაქმნის ლექსიკონის კლავიშებს სიაში.
    keys_list.sort()#ის ახარისხებს გასაღებების სიას ზრდის მიხედვით
    return keys_list#აბრუნებს გასაღებების დახარისხებულ სიას

# 6. შექმენით ფუნქცია სახელწოდებით manual_keys
def manual_keys(dictionary):#აბრუნებს კლავიშების ჩამონათვალს ლექსიკონიდან, 
    return list(dictionary.keys())# შესაყვანად იღებს ლექსიკონს.

# 7. შექმენით ფუნქცია სახელწოდებით manual_values
def manual_values(dictionary): #ამოიღებს ყველა მნიშვნელობას ლექსიკონიდან
    return list(dictionary.values())#აბრუნებს მიღებულ სიას, რომელიც შეიცავს ლექსიკონის ყველა მნიშვნელობას.

