//1.შექმენით map-ის კოპიო ფუნქცია სახელად manualMap
//function manualMap(arr, callback) { //ManualMap ფუნქცია იღებს ორ პარამეტრს
//    let newArr = [];//ეს შეინახავს შეყვანის მასივის თითოეულ ელემენტზე გამოძახების ფუნქციის გამოყენების შედეგებს.
//    for (let i = 0; i < arr.length; i++) { //შეყვანის მასივი მეორდება, ეს ათვლა იქმადე გაგრძელდება სანამ მასივის სიგრძეზე ნაკლები არ იქნება
//      newArr.push(callback(arr[i]));//გამოძახების შედეგი გადადის newArr მასივში
//    }
//    return newArr;// საბოლოოდ ფუნქცია აბრუნბეს newArr -ის 
//  }





