//დავალება 1: შექმენით პითონში ფუნქცია სახელად manual pop. მას გადაეცემა ორი არგუმენტი - სია და ინდექსი, რომელიც გვინდა რომ სიიდან წავშალოთ. ინდექსის default მნიშვნელობა უნდა იყოს -1. 
//for ციკლით ახალ სიაში მხოლოდ ის ელემენტები უნდა დავამატოთ, რომელიც არ უტოლდება ამ ინდექსს. საბოლოოდ დავაბრუნოთ ეს სია
//დავალება 2: შექმენით პითონში ფუნქცია "manual_pop" გადაეცით ორი არგუმენტი (სია,ინდექსი) თუ ინდექს პარამეტრს არგადაეცემა არანაირი პარამეტრი default = -1.
//For ციკლის გამოყენებით დაწერეთ ალგორითმი რომელიც ახალ სიაში ამატებს იმ ელემენტებს რომელიც ინდექს პარამეტრში არწერია. ბოლოს გამოიტანეთ ეს სია 
// შექმენით for ციკლი რომელიც გამოიტანს ციფრებს 1-10